DataProcessors/АРМРаботникОхраны_ПриемПоПутевомуЛисту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>АРМРаботникОхраны_ПриемПоПутевомуЛисту</Name>
			<Comment>Охрана Пост 2 Прием По ПУТЕВОМУ ЛИСТУ (ГОРОД)</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ПутевойЛист_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПутевойЛист_2</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеТары</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыАптека</xr:Item>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
				<xr:Item>InformationRegister.РегТарыПоШК</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыВодитель</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьКонтрагентов</Name>
					<Comment>Если ИСТИНА то при сохранении будет объединять контрагентов в один документ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПрихода</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратныеСФ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФНомерСчетфактуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФКонтрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФКомментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратнаяСчетФактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПогрузкаТоваровВАвтомобиль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПогрузкаТоваровВАвтомобиль</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКоробок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>мВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШКПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыРасхода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Док</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МестаОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоОтгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКоробок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПрихода</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутевойЛист</Name>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/АРМРаботникОхраны_ПриемПоПутевомуЛисту/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
  Процедура Сброс(Команда)
	  СброситьДанныеФормы(Истина); 
	  СбросКромеОхраны=Истина;
	  ФактурПроверка();
  КонецПроцедуры
  
  &НаКлиенте
  Процедура СброситьДанныеФормы(ОчищатьСообщения,ВыводитьСообщенияСброса=Истина) 
	  Если ОчищатьСообщения Тогда
		  ОчиститьСообщения();	
	  КонецЕсли;
	  
	  Если ВыводитьСообщенияСброса Тогда
		  Если СбросКромеОхраны Тогда
			  Сообщить("Введите ШК Водителя.");		
		  Иначе
			  ШКОхрана="";
			  РаботникОхраны="";
			  Сообщить("Введите ШК Работника Охраны.");	
		  КонецЕсли;
	  КонецЕсли;
	  ШКВодитель="";
	  Водитель="";
	  ПутевойЛист="";
	  ШКДокумент="";
	  //
	  КолКоробок="" ;
	  КолКоробокБЯС="";
	  КолКоробокВАвто="";
	  БЯС="";
	  ДокПогрузкаВАвто="";
	  СчетФ="" ;
	  //
	  
	  СписокНеОтгруженныхБЯСвПЛ.Очистить();
	  СписокОтгруженныхБЯСвПЛ.Очистить();
	  ФактурПроверка();
  КонецПроцедуры
  &НаКлиенте
  Процедура ПриОткрытии(Отказ)
	  ДатаПутевогоЛиста=НачалоДня(ТекущаяДата());
	  СбросКромеОхраны=Истина;
	  ФактурПроверка();
  КонецПроцедуры
  
  &НаКлиенте
  Процедура ВнешнееСобытие(Источник, Событие, Данные)
	  //Если НЕ ВводДоступен() Тогда
	  //    Возврат;
	  //КонецЕсли;
	  
	  Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		  
		  Если ЗначениеЗаполнено(СокрЛП(Данные)) Тогда
			  //--- Сброс Формы
			  //Сообщить(СокрЛП(Данные));
			  Если (СокрЛП(Данные))="000000000000" Тогда
				  
				  ОчиститьСообщения();
				  Сброс(Null);
				  //Сообщить("Сброс");
				  Возврат;
			  КонецЕсли;
			   //Сохранить
			  Если (СокрЛП(Данные))="111111111111" Тогда
				  //Сохранить запись
				  Сохранить(NULL);
				  Возврат;
				  //
			  КонецЕсли;
			  
			  //Принять Весь ПутевойЛист
			    Если  ЗначениеЗаполнено(ПутевойЛист) Тогда
					ШКпутевогоЛиста=ПолучитьШКПутевогоЛиста();
					Если ШКпутевогоЛиста=СокрЛП(Данные) Тогда
						ПринятьВесьПутевойЛист(NULL);
						Возврат;	
					КонецЕсли;
				КонецЕсли;
			  
			  //Если охрана не заполнена то Ищем Охранника
			  Если Не ЗначениеЗаполнено(ШКОхрана) Тогда
				  ШКОхрана = Данные;
				  НайденныйОхранник = модСерверПолныеПрава.НайтиФизЛицоПоШк(ШКОхрана,"РаботникОхраны");
				  Если Не ЗначениеЗаполнено(НайденныйОхранник) Тогда
					  ОчиститьСообщения();
					  Сообщить("Охранник не найден. Введите правильный ШК Охранника");
					  ШКОхрана = "";
					  РаботникОхраны = "";
				  Иначе 
					  РаботникОхраны = НайденныйОхранник;
				  КонецЕсли;
				  Возврат;
			  КонецЕсли;	
			  
			  //Если Охрана заполнена - Ищем Водителя		
			  
			  Если ЗначениеЗаполнено(РаботникОхраны) и НЕ ЗначениеЗаполнено(Водитель) Тогда
				  ШКВодитель = Данные;
				  Водитель = модСерверПолныеПрава.НайтиФизЛицоПоШк(ШКВодитель,"Водитель");
				  
				  Если ЗначениеЗаполнено(Водитель) Тогда
					  //Ищем Для него Путевой Лист и Заполняем Списки
					  ПутевойЛист=модСерверПолныеПрава.НайтиПутевойЛист_2(Водитель,ДатаПутевогоЛиста );
					  Если ЗначениеЗаполнено(ПутевойЛист) Тогда
						  //Заполняем Списки
						  Результат=ЗаполнитьСпискиПоПутевомуЛисту();
						  СчетФ="";
						  КолКоробок="";
						  Сообщить(Результат);
						  Возврат;
					  Иначе
						  Сообщить("Для водителя "+Водитель+" нет путевого листа на дату "+Формат(ДатаПутевогоЛиста,"ДФ=dd.MM.yyyy")+". Введите ШК Другого Водителя.");
						  //Очищаем Форму
						  СброситьДанныеФормы(Ложь,Ложь); 	
					  КонецЕсли;
					  Возврат;
				  Иначе
					  Сообщить("Водитель не найден. Введите правильный ШК Водителя");
					  Возврат;
				  КонецЕсли;			
				  
			  КонецЕсли;
			  
			  // Если Охрана и Водитель Заполнены то проверяем сначало На НОвого Водителя
			  Если ЗначениеЗаполнено(РаботникОхраны) и ЗначениеЗаполнено(Водитель) Тогда
				  ШКНовыйВодитель=Данные;
				  НовыйВодитель=  модСерверПолныеПрава.НайтиФизЛицоПоШк(ШКНовыйВодитель,"Водитель");
				  Если ЗначениеЗаполнено(НовыйВодитель)  Тогда
					  ШКВодитель=ШКНовыйВодитель;
					  Водитель=НовыйВодитель;
					  //Ищем Для него Путевой Лист и Заполняем Списки
					  ПутевойЛист=модСерверПолныеПрава.НайтиПутевойЛист_2(Водитель,ДатаПутевогоЛиста );
					  Если ЗначениеЗаполнено(ПутевойЛист) Тогда
						  //Заполняем Списки
						  Результат=ЗаполнитьСпискиПоПутевомуЛисту();
						  СчетФ="";
						  КолКоробок="";
						  Сообщить(Результат);
						  Возврат;
					  Иначе
						  Сообщить("Для водителя "+Водитель+" нет путевого листа на дату "+Формат(ДатаПутевогоЛиста,"ДФ=dd.MM.yyyy")+". Введите ШК Другого Водителя.");
						  // Очищаем списки
						  СброситьДанныеФормы(Ложь,Ложь);
					  КонецЕсли;
					  
					  Возврат;	
				  КонецЕсли;
				  
			  КонецЕсли;
			  
			  
			  //---------------ДОКУМЕНТ--------------------//		
			  // Ищем Документ
			  ШКДокумент = Лев(Данные, 12);
			  //Проверяем Есть ли эта БЯС в Нашем ПЛ
			  найтиПутевойЛист=модСерверПолныеПрава.НайтиПутевойЛист_2(Водитель,ДатаПутевогоЛиста,ШКДокумент );
			  
			  Если  найтиПутевойЛист<>ПутевойЛист Тогда
				  Сообщить("Документа с таким ШК-"+ШКДокумент+" нет в Путевом листе.");
				  КолКоробок="";
				  СчетФ="" ;
				  БЯС="";
				  Возврат ;	 
			  КонецЕсли;
			  
			  //Проверяем может он уже отгрузился
			  ДокПогрузкаВАвто = модСерверПолныеПрава.НайтиПогрузкаТоваровВАвтомобильПоШК(ШКДокумент);//Ищем док
			  //Если Отгрузилcя то 
			  Если ЗначениеЗаполнено(ДокПогрузкаВАвто) Тогда
				  Сообщить("СчетФ-"+ДокПогрузкаВАвто.ДокументОснование.НомераСФ+" уже отгружены.");
				  КолКоробок=ДокПогрузкаВАвто.КоличествоКоробок;
				  СчетФ=ДокПогрузкаВАвто.ДокументОснование.НомераСФ ;
				  //БЯС="";
				  //ШКДокумент="";
				  Возврат;
			  КонецЕсли;
			  
			  
			  // Если Есть то заполняем КолМест
			  БЯС=модСерверПолныеПрава.НайтиДокБЯСпоШК(ШКДокумент);
			  Если НЕ ЗначениеЗаполнено(БЯС) Тогда
				  Сообщить("Документ с ШК-"+ШКДокумент+" не найден.");
				  Возврат;
			  КонецЕсли;
			  
			  КолКоробок=БЯС.Коробки ;
			  СчетФ=БЯС.НомераСФ ;
			  
			  //СохранитьСЕРВЕР(ШКДокумент);
			  //ЗаполнитьСпискиПоПутевомуЛисту();
			  
			  
		  КонецЕсли;
		  
	  КонецЕсли;
	  ФактурПроверка();

  КонецПроцедуры
  
  &НаСервере
  Функция  ЗаполнитьСпискиПоПутевомуЛисту()
	  
	  // Очищаем списки
	  СписокНеОтгруженныхБЯСвПЛ.Очистить();
	  СписокОтгруженныхБЯСвПЛ.Очистить();
	  //Определяем БЯС в Путевом Листе Не Отгруженные(Нет ПогрузкиВАвто);
	  Запрос = Новый Запрос;
	  Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	ПутевойЛист_2Данные.ДокументПрихода
	  |ИЗ
	  |	Документ.ПутевойЛист_2.Данные КАК ПутевойЛист_2Данные
	  |ГДЕ
	  |	ПутевойЛист_2Данные.Ссылка = &ПутевойЛист
	  |	И ПутевойЛист_2Данные.ДокументПрихода.ПогрузкаВАвто = &ПогрузкаВАвто";
	  
	  Запрос.УстановитьПараметр("ПутевойЛист", ПутевойЛист);
	  Запрос.УстановитьПараметр("ПогрузкаВАвто", Документы.ПогрузкаТоваровВАвтомобиль.ПустаяСсылка());
	  
	  Результат = Запрос.Выполнить();
	  
	  
	  ВыборкаДетальныеЗаписи = Результат.Выбрать();
	  
	  КолНеОтгруженных=ВыборкаДетальныеЗаписи.Количество();
	  
	  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		  новаяСтрока=СписокНеОтгруженныхБЯСвПЛ.Добавить();
		  новаяСтрока.ДокБЯС=ВыборкаДетальныеЗаписи.ДокументПрихода;
	  КонецЦикла;
	  //Определяем БЯС в Путевом Листе  Отгруженные(Есть ПогрузкиВАвто);
	  Запрос = Новый Запрос;
	  Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	ПутевойЛист_2Данные.ДокументПрихода
	  |ИЗ
	  |	Документ.ПутевойЛист_2.Данные КАК ПутевойЛист_2Данные
	  |ГДЕ
	  |	ПутевойЛист_2Данные.Ссылка = &ПутевойЛист
	  |	И ПутевойЛист_2Данные.ДокументПрихода.ПогрузкаВАвто <> &ПогрузкаВАвто";
	  
	  
	  Запрос.УстановитьПараметр("ПутевойЛист", ПутевойЛист);
	  Запрос.УстановитьПараметр("ПогрузкаВАвто", Документы.ПогрузкаТоваровВАвтомобиль.ПустаяСсылка());
	  
	  Результат = Запрос.Выполнить();
	  
	  ВыборкаДетальныеЗаписи = Результат.Выбрать();
	  КолОтгруженных=ВыборкаДетальныеЗаписи.Количество();
	  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		  новаяСтрока=СписокОтгруженныхБЯСвПЛ.Добавить();
		  новаяСтрока.ДокБЯС=ВыборкаДетальныеЗаписи.ДокументПрихода;
		  Если  новаяСтрока.ДокБЯС.Коробки <> новаяСтрока.ДокБЯС.ПогрузкаВАвто.КоличествоКоробок Тогда
		  	новаяСтрока.РазницаВКолМест=Истина;
		  КонецЕсли;
	  КонецЦикла;
	  
	  Если КолНеОтгруженных=0 Тогда
		  Возврат "Путевой Лист отгрузился  полностью"; //ПЛ отгрузился  полностью
	  ИначеЕсли  КолОтгруженных=0 Тогда
		  Возврат "Путевой Лист еще не отгружался"; //ПЛ не отгрузился совсем
	  Иначе
		  Возврат "Путевой Лист  отгрузился Частично.";  //ПЛ  отгрузился Частично
		  
		  
	  КонецЕсли;
	  
	  
  КонецФункции
  
  
  &НаСервере
  Функция СохранитьСЕРВЕР(ШК)
	  //Сообщить(КолКоробок);
	  //Проверяем Есть ли эта БЯС в Нашем ПЛ
	  найтиПутевойЛист=модСерверПолныеПрава.НайтиПутевойЛист_2(Водитель,ДатаПутевогоЛиста,ШК );
	  
	  Если  найтиПутевойЛист<>ПутевойЛист Тогда
		  Сообщить("Такого Документа нет в Путевом листе.");
		  Возврат 0;	 
	  КонецЕсли;
	  //Сохраняем (Создаем) документ  ПогрузкаТоваровВАвтомобиль
	  
	  //Проверяем может он уже отгрузился
	  Документ = модСерверПолныеПрава.НайтиПогрузкаТоваровВАвтомобильПоШК(ШК);//Ищем док
	  ДокПогрузкаВАвто=Документ;
	  //Если Отгрузилcя то 
	  Если ЗначениеЗаполнено(ДокПогрузкаВАвто)и ДокПогрузкаВАвто.ДокументОснование.ВозвратВодителя=Ложь Тогда
		  Сообщить("СчетФ-"+ДокПогрузкаВАвто.ДокументОснование.НомераСФ+" уже отгружены.");
		  КолКоробок=ДокПогрузкаВАвто.КоличествоКоробок;
		  СчетФ=ДокПогрузкаВАвто.ДокументОснование.НомераСФ ;
		  БЯС="";
		  ШКДокумент="";
		  Возврат 0;
	  КонецЕсли;
	  
	  
	  
	  
	  Если Документ = Неопределено или  ДокПогрузкаВАвто.ДокументОснование.ВозвратВодителя=Истина Тогда
		  
		  //Создаем Документ
		  
		  Документ=модСерверПолныеПрава.СохранитьДокПогрузкаВАвто_АРМ_ПЛ(ШК,ЭтаФорма);
		  //ДокБЯС=модСерверПолныеПрава.НайтиДокБЯСпоШК(ШК);
		  //
		  //Документ=Документы.ПогрузкаТоваровВАвтомобиль.СоздатьДокумент();
		  //Документ.Дата =ТекущаяДата();
		  //Документ.Водитель=Водитель;
		  //Документ.РаботникОхраны=РаботникОхраны;
		  //Документ.Подразделение=ДокБЯС.Организация;
		  //Документ.ПутевойЛист=ПутевойЛист;
		  //Документ.ДокументОснование=ДокБЯС;
		  //Документ.Контрагент=ДокБЯС.Получатель;
		  ////Документ.КоличествоКоробок=ДокБЯС.Коробки;
		  //Документ.КоличествоКоробок=КолКоробок;
		  //Документ.ДокументыРасхода.Загрузить(ДокБЯС.ДокументыРасхода.Выгрузить());
		  //Документ.МестаОтгрузки.Загрузить(ДокБЯС.МестаОтгрузки.Выгрузить());
		  //
		  //Документ.Записать(РежимЗаписиДокумента.Проведение);
		  //
		  ////Ставим Дату Конца Отгрузки в БЯС
		  //Попытка
		  //	ДокБЯС=ДокБЯС.ПолучитьОбъект();
		  //	ДокБЯС.КонецОтгрузки=ТекущаяДата();
		  //	ДокБЯС.ПогрузкаВАвто=Документ.Ссылка;	
		  //	ДокБЯС.Записать(РежимЗаписиДокумента.Запись);
		  //Исключение
		  //КонецПопытки;
		  //
		  Сообщить("СчетФ-"+ Документ.ДокументОснование.НомераСФ+" документ записан.");
		  
	  Иначе
		  Сообщить("СчетФ - "+Документ.ДокументОснование.НомераСФ+" отгрузка уже выполнена.");
		  Возврат 0;
	  КонецЕсли;
	  
	  
	  
	  
  КонецФункции
  
  &НаКлиенте
  Функция  ПроверитьЗаполнениеПолей(ДляПутевогоЛиста=Ложь)
	  
	  Если ДляПутевогоЛиста Тогда 
		   Если НЕ ЗначениеЗаполнено(РаботникОхраны) Тогда
			  Возврат "Не выбран РАБОТНИК ОХРАНЫ.";
		  ИначеЕсли НЕ ЗначениеЗаполнено(Водитель) Тогда
			  Возврат "Не выбран ВОДИТЕЛЬ."; 
		  ИначеЕсли НЕ ЗначениеЗаполнено(ПутевойЛист) Тогда	
			  Возврат "Не выбран ПУТЕВОЙ ЛИСТ.";
		   Иначе
			  Возврат Истина;
		  КонецЕсли;
	  Иначе
		  Если НЕ ЗначениеЗаполнено(РаботникОхраны) Тогда
			  Возврат "Не выбран РАБОТНИК ОХРАНЫ.";
		  ИначеЕсли НЕ ЗначениеЗаполнено(Водитель) Тогда
			  Возврат "Не выбран ВОДИТЕЛЬ."; 
		  ИначеЕсли НЕ ЗначениеЗаполнено(ШКДокумент) Тогда	
			  Возврат "Не выбрана СЧЕТ ФАКТУРА.";
		  ИначеЕсли СчетФ="" Тогда	
			  Возврат "Не выбрана СЧЕТ ФАКТУРА.";
		  Иначе
			  Возврат Истина;
		  КонецЕсли;
	  КонецЕсли;
	  
  КонецФункции
  
  
  &НаКлиенте
  Процедура Сохранить(Команда)
	  
	  
	  ЭтаФорма.ТекущийЭлемент=Элементы.ШКДокумент;
	  
	  
	  //Проверка на заполнение полей
	  
	  Если ПроверитьЗаполнениеПолей()<>Истина Тогда
		  Предупреждение(ПроверитьЗаполнениеПолей());
		  Возврат;	
	  КонецЕсли;
	  
	  // Убрал проверку 25,11,2013 - т.к. Есть доп счет фактуры без места
	  //Если КолКоробок=0 Тогда
	  //	ЭтаФорма.ТекущийЭлемент=Элементы.КолКоробок;
	  //	//	Сообщить("Заполните количество коробок.");
	  //	Предупреждение("Заполните количество коробок.");
	  //	Возврат;	
	  //КонецЕсли;
	  
	  СохранитьСЕРВЕР(ШКДокумент);
	  ЗаполнитьСпискиПоПутевомуЛисту();
	  	  ФактурПроверка();

  КонецПроцедуры
  
  
  &НаКлиенте
  Процедура ПринятьВесьПутевойЛист(Команда)
	  
	  Если Вопрос("Принять весь путевой лист водителя "+Водитель+"?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		  Возврат;
	  КонецЕсли;
	  
	    
	  Если ПроверитьЗаполнениеПолей(Истина)<>Истина Тогда
		  Предупреждение(ПроверитьЗаполнениеПолей());
		  Возврат;	
	  КонецЕсли;

	  
	  ПринятьВесьПутевойЛистСЕРВЕР();
	  ЗаполнитьСпискиПоПутевомуЛисту();
	  ФактурПроверка();

  КонецПроцедуры
  
  &НаСервере
  Процедура ПринятьВесьПутевойЛистСЕРВЕР()
	  
	  //Выбираем БЯС Из Путевого Листа
	  Для Каждого стр_Данные  Из ПутевойЛист.Данные Цикл
		  ДокБЯС=стр_Данные.ДокументПрихода;
		  //Ищем была ли уже погрузка
		  найтиПогрузку = Документы.ПогрузкаТоваровВАвтомобиль.НайтиПоРеквизиту("ДокументОснование",ДокБЯС);//Ищем док
		  Если ЗначениеЗаполнено(найтиПогрузку) и  ДокБЯС.ВозвратВодителя=Ложь Тогда
			  Сообщить("СчетФ - "+найтиПогрузку.ДокументОснование.НомераСФ+" отгрузка уже выполнена.");
			  Продолжить;
		  КонецЕсли;
		  // Если не нашли то Создаем Док
		  
		  //Создаем Документ
		  
		  Если ЗначениеЗаполнено(ДатаПогрузкиВАвто) и ДокБЯС.ВозвратВодителя=Ложь  Тогда
			  ДатаПогрузки=ДатаПогрузкиВАвто;
		  Иначе
			  ДатаПогрузки=ТекущаяДата();	  
		  КонецЕсли;
		  
		  
		  Документ=модСерверПолныеПрава.СохранитьДокПогрузкаВАвто_АРМ_ПЛ(Неопределено,ЭтаФорма,ДокБЯС);

		  Документ=Документы.ПогрузкаТоваровВАвтомобиль.СоздатьДокумент();
		  Документ.Дата =ДатаПогрузки;
		  Документ.Водитель=Водитель;
		  Документ.РаботникОхраны=РаботникОхраны;
		  Документ.Подразделение=ДокБЯС.Организация;
		  Документ.ПутевойЛист=ПутевойЛист;
		  Документ.ДокументОснование=ДокБЯС;
		  Документ.Контрагент=ДокБЯС.Получатель;
		  Документ.КоличествоКоробок=ДокБЯС.Коробки;
		  //Документ.КоличествоКоробок=КолКоробок;
		  Документ.ДокументыРасхода.Загрузить(ДокБЯС.ДокументыРасхода.Выгрузить());
		  Документ.МестаОтгрузки.Загрузить(ДокБЯС.МестаОтгрузки.Выгрузить());
		  
		  Документ.Записать(РежимЗаписиДокумента.Проведение);
		  
		  //Ставим Дату Конца Отгрузки в БЯС
		  Попытка
		  	ДокБЯС=ДокБЯС.ПолучитьОбъект();
		  	ДокБЯС.КонецОтгрузки=ДатаПогрузки;
		  	ДокБЯС.ПогрузкаВАвто=Документ.Ссылка;	
		  	ДокБЯС.Записать(РежимЗаписиДокумента.Запись);
		  Исключение
		  КонецПопытки;
		  
		  Сообщить("СчетФ-"+ Документ.ДокументОснование.НомераСФ+" документ записан.");
		  
		  
	  КонецЦикла;
  
  КонецПроцедуры
  
  &НаСервере
  Функция  ПолучитьШКПутевогоЛиста()
 Попытка 
	  Возврат ПутевойЛист.ПолучитьОбъект().СформироватьШК();	  
  Исключение
  КонецПопытки;
  
КонецФункции
&НаКлиенте
Функция ФактурПроверка()
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	ПутевойЛист_2Данные.ДокументПрихода
               |ИЗ
               |	Документ.ПутевойЛист_2.Данные КАК ПутевойЛист_2Данные
               |ГДЕ
               |	ПутевойЛист_2Данные.ДокументПрихода.ПогрузкаВАвто <> &ПогрузкаВАвто
               |	И ПутевойЛист_2Данные.Ссылка.Дата >= &Дата";

Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
Запрос.УстановитьПараметр("ПогрузкаВАвто",Документы.ПогрузкаТоваровВАвтомобиль.ПустаяСсылка());

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
ФактурСканировано=Выборка.Количество();
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	ПутевойЛист_2Данные.ДокументПрихода
               |ИЗ
               |	Документ.ПутевойЛист_2.Данные КАК ПутевойЛист_2Данные
               |ГДЕ
               |	ПутевойЛист_2Данные.Ссылка.Дата >= &Дата";

Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
ФактурВсего=Выборка.Количество();
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
ФактурСканировано=Выборка.Количество();
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	ПутевойЛист_2Данные.ДокументПрихода
|ИЗ
|	Документ.ПутевойЛист_2.Данные КАК ПутевойЛист_2Данные
|ГДЕ
|	ПутевойЛист_2Данные.Ссылка.Дата >= &Дата
|	И ПутевойЛист_2Данные.ДокументПрихода.ПогрузкаВАвто = &ПогрузкаВАвто";

Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
Запрос.УстановитьПараметр("ПогрузкаВАвто",Документы.ПогрузкаТоваровВАвтомобиль.ПустаяСсылка());

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
ФактурОсталось=Выборка.Количество();
	
КонецФункции

&НаКлиенте
  Процедура СписокОтгруженныхБЯСвПЛВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	  //Сообщить(Элементы.СписокОтгруженныхБЯСвПЛ.ТекущиеДанные.ДокБЯС.ПогрузкаВАвто);
	  ОткрытьЗначение(Элементы.СписокОтгруженныхБЯСвПЛ.ТекущиеДанные.ДокБЯС.ПогрузкаВАвто);
  КонецПроцедуры


&НаКлиенте
  Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	  
	  Если ИмяСобытия="ОбновитьСписокОтгруженныхБЯС" Тогда
		  Рез=ЗаполнитьСпискиПоПутевомуЛисту();
	  КонецЕсли;
  КонецПроцедуры


&НаСервере
  Процедура ПутевойЛист1ПриИзмененииНаСервере()
	  // Вставить содержимое обработчика.
  КонецПроцедуры


&НаКлиенте
Процедура ПутевойЛист1ПриИзменении(Элемент)
	 ЗаполнитьСпискиПоПутевомуЛисту();
	  ПутевойЛист1ПриИзмененииНаСервере();
  КонецПроцедуры
